package by.tms.DomashneeZadanie._2_String;

// Написать метод который принимает строку и реверсирует
public class Zada4a_1 {
    public static void main(String[] args) {
        StringBuffer a = new StringBuffer("Hello by.tms.Test");
        a.reverse();
        System.out.println(a);
    }
}

