package by.tms._Lessons_.Ch19_Collections_Framework;

//java.util



//Классы коллекций;

//class ArrayList<E> - реализует динамический массив, расширяя класс AbstartList и реализует интерефейс List;
//E - тип сохраняемых объекта;

//Конструкторы;
//ArrayList() - пустой списочный массив;
//ArrayList(Collection <? extends E> c) - списочный массив, иницизирцемый элементами из заданной коллекции;
//ArrayList(int ёмкость) - списочный массив, который имеет начальный размер массива;

//add - добавить элемент в массив;
//remove - удалить элемент из массива;

//void ensureCapacity(int ёмкость) - увеличевает ёмкость базового массива;
//void trimToSize() - уменьшает ёмкость базового массива;

//Object[] toArray() - возращает масив объекта;
//<T> T[] toArray(T array[]) - возращает массив элементов, к типу T;

//class LinkedList<E> - реализует связанный список, расширяя класс AbstartSequentalList и реализует интерефейсы List, Dequeue и Quene.;
//E - тип сохраняемых объекта;

//Конструкторы;
//LinkedList() - пустой связный список;
//LinkedList(Collection<? extends E> c) - связный массив, иницизирцемый элементами из заданной коллекции;

//add() - добавить элемент в массив;
//remove() - удалить элемент из массива;
//addFirst() или offerFirst() - в начале;
//aadLast() или offerLast() - в конце;
//getFirst() или peekFirst() - получить элемент первый;
//getLast() или peekLast() - получить элемент последний;
//removeFirst() или pollFirst() - удалить первый элемент;
//removeLast() или pollLast() - удалить последний элемент;
//get() - получить текущее значение;
//set() - присвоить новое значение;
