package by.tms._Lessons_.Ch05.Операторы._1_Выбор.If_Else;

public class IfElse {
    public static void main(String[] args) {
        int месяц = 12;  //Декабрь
        String сезон;

        if (месяц == 3 || месяц == 4 || месяц == 5) {
            сезон = "Весна";
        } else if (месяц == 6 || месяц == 7 || месяц == 8) {
            сезон = "Лето";
        } else if (месяц == 9 || месяц == 10 || месяц == 11) {
            сезон = "Осень";
        } else if (месяц == 12 || месяц == 1 || месяц == 2) {
            сезон = "Зима";
        } else {
            сезон = "Нет такого месяца";
        }
        System.out.println("Декабрь - это " + сезон + ".");
    }
}